tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bat" #Clone of cat(1) with syntax highlighting and Git integration
#brew "direnv" #Load/unload environment variables based on $PWD
brew "node"
brew "python"
brew "python3"
brew "stow" #stow lets you symlink to a directory so you can manage your .dotfiles in git
brew "htop" #htop is a system resource monitor for the command line.
brew "nmap" #nmap is a top notch network security scanner.
# brew "mas" #mac app store so you can brew install app store apps
# brew "telnet" #User interface to the TELNET protocol (built from macOS Sierra sources)
brew "tree" #Display directories as trees (with optional color/HTML output)
brew "ripgrep" #ripgrep is a line-oriented search tool that recursively searches the current directory for a regex pattern. 
brew "gawk" #makes it possible to handle simple data-reformatting jobs with just a few lines of code https://www.gnu.org/software/gawk/ 
brew "maven" #our build tool
brew "git-standup" # tells you the commits you've made recently
#brew "direnv" #cool directory specific environmental variables http://direnv.net/
## brew "ranger" <- try some day
cask "gitkraken" #our teams default tool 
## cask "ngrok"  <- looks really cool.  should try sometime. 
cask "postman" #heavily used for API testing
cask "iterm2" #preferred terminal
cask "transmit" #SFTP client
cask "telegram" #secure chat client 1
cask "signal" #secure chat client 2
#cask "spotify" #music player
cask "jd-gui" #java decompiler and browser
cask "java" #java! 
cask "adoptopenjdk8" #current JDK we're using
#cask "omnigraffle"
cask "visual-studio-code" #preferred angular editor
#cask "firefox" 
#cask "google-chrome" 
#cask "slack"
cask "font-fira-code"
cask "font-hack-nerd-font"
##cask "dbeaver-community" <- I use datagrip...
cask "shimo" #favorite SSH client
#cask "parallels"
#cask "virtualbox" # <- it's important to immediately approve "Oracle" in the security settings.  Otherwise this doesn't work. 
cask "postgresql" #love that postgres
cask "pgadmin4" #postgres admin tool
cask "vlc" #vlc media player
#cask "zoomus" #preferred meeting software
#cask "evernote"
#cask "notion"
cask "fliqlo" #screensaver!
#cask "jetbrains-toolbox" #toolbox is awesome.  
#mas "Magnet", id: 441258766
## mas "Monosnap", id: 540348655
