tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bat" #Clone of cat(1) with syntax highlighting and Git integration
#brew "direnv" #Load/unload environment variables based on $PWD
brew "node"
brew "python"
brew "python3"
brew "mackup"
brew "htop" #htop is a system resource monitor for the command line.
brew "nmap" #nmap is a top notch network security scanner.
brew "mas"
# brew "telnet" #User interface to the TELNET protocol (built from macOS Sierra sources)
brew "tree" #Display directories as trees (with optional color/HTML output)
brew "ripgrep"
brew "gawk"
brew "maven"
## brew "git-standup" <- cooler if i use GIT more often
## brew "ranger" <- try some day
cask "gitkraken"
## cask "ngrok"  <- looks really cool.  should try sometime. 
cask "postman"
cask "iterm2"
cask "transmit"
cask "telegram"
cask "spotify"
cask "jd-gui"
cask "java"
cask "omnigraffle"
#cask "visual-studio-code" #already installed
cask "firefox"
#cask "google-chrome" #already installed.
cask "slack"
cask "font-fira-code"
##cask "dbeaver-community" <- I use datagrip...
cask "shimo"
cask "parallels"
cask "virtualbox" # <- it's important to immediately approve "Oracle" in the security settings.  Otherwise this doesn't work. 
cask "postgresql"
cask "pgadmin4" #postgres admin tool
cask "vlc" #vlc media player
cask "zoomus" #meeting software used by imm registry ppl
cask "evernote"
cask "notion"
cask "fliqlo" #screensaver!
cask "jetbrains-toolbox"
#mas "Magnet", id: 441258766
## mas "Monosnap", id: 540348655
